app/controllers/areas/cursos_controller.rb

SELECT "cursos".* FROM "cursos" WHERE "cursos"."area_id" = ? AND "cursos"."id" = ? LIMIT ?  [["area_id", 10], ["id", 14], ["LIMIT", 1]]
---
  def show
    @curso = @area.cursos.find(params[:id])

INSERT INTO "cursos" ("area_id", "nombre_curso", "des_curso", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["area_id", 7], ["nombre_curso", "arroz"], ["des_curso", nil], ["created_at", "2022-04-18 14:51:48.363429"], ["updated_at", "2022-04-18 14:51:48.363429"]]
---
  def create
    @curso = @area.cursos.new(curso_params)
    if @curso.save

SELECT "cursos".* FROM "cursos" WHERE "cursos"."area_id" = ? AND "cursos"."id" = ? LIMIT ?  [["area_id", 7], ["id", 19], ["LIMIT", 1]]
DELETE FROM "cursos" WHERE "cursos"."id" = ?  [["id", 19]]
---
  def destroy
    @curso = @area.cursos.find(params[:id])
    if @curso.destroy

SELECT "cursos".* FROM "cursos" WHERE "cursos"."area_id" = ? AND "cursos"."id" = ? LIMIT ?  [["area_id", 10], ["id", 18], ["LIMIT", 1]]
---
  def edit
    @curso = @area.cursos.find(params[:id])

SELECT "cursos".* FROM "cursos" WHERE "cursos"."area_id" = ? AND "cursos"."id" = ? LIMIT ?  [["area_id", 10], ["id", 18], ["LIMIT", 1]]
UPDATE "cursos" SET "nombre_curso" = ?, "updated_at" = ? WHERE "cursos"."id" = ?  [["nombre_curso", "vv"], ["updated_at", "2022-04-04 19:53:25.032991"], ["id", 18]]
---
  def update
    @curso = @area.cursos.find(params[:id])
    if @curso.update(curso_params_update)

SELECT "areas".* FROM "areas" WHERE "areas"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def set_area
      @area = Area.find(params[:area_id])