app/controllers/areas_controller.rb

  def index
    @areas = Area.all
---
SELECT "areas".* FROM "areas"

  def show
    @area = Area.find(params[:id])
---
SELECT "areas".* FROM "areas" WHERE "areas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @area = Area.new(area_params)
    if @area.save
---
INSERT INTO "areas" ("codigo_area", "nombre", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["codigo_area", nil], ["nombre", "Diseño"], ["created_at", "2022-03-25 03:23:42.508035"], ["updated_at", "2022-03-25 03:23:42.508035"]]

  def edit
    @area = Area.find(params[:id])
---
SELECT "areas".* FROM "areas" WHERE "areas"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def update
    @area = Area.find(params[:id])
    if @area.update(area_params_update)
---
SELECT "areas".* FROM "areas" WHERE "areas"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "areas" SET "nombre" = ?, "updated_at" = ? WHERE "areas"."id" = ?  [["nombre", "pepe"], ["updated_at", "2022-04-04 03:45:22.937691"], ["id", 7]]

  def destroy
    @area = Area.find(params[:id]).destroy
---
DELETE FROM "areas" WHERE "areas"."id" = ?  [["id", 9]]
SELECT "areas".* FROM "areas" WHERE "areas"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]