app/controllers/ficha_controller.rb

SELECT "fichas".* FROM "fichas"
---
  def index
    @fichas = Ficha.all